src/Catalogs/Сотрудники/Сотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Сотрудники</name>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделение</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/Сотрудники/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
 Процедура ФамилияПриИзменении(Элемент)
	СформироватьФИО();
 КонецПроцедуры


&НаКлиенте
 Процедура ИмяПриИзменении(Элемент)
	 СформироватьФИО();
 КонецПроцедуры


&НаКлиенте
 Процедура ОтчествоПриИзменении(Элемент)
	 СформироватьФИО();
 КонецПроцедуры  
 

 &НаКлиенте
 Процедура ФормированиеФИО() 
	Объект.Наименование = СокрЛП(Объект.Фамилия) + " " + СокрЛП(Объект.Имя) + " " + СокрЛП(Объект.Отчество);
 КонецПроцедуры
 
 
//Если объект Отчество не заполнен чтобы избежать лишних пробелов  

Процедура СформироватьФИО()
	МассивФИО = Новый Массив();
	Если ЗначениеЗаполнено(Объект.Фамилия) Тогда
		МассивФИО.Добавить(СокрЛП(Объект.Фамилия));	
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.Имя) Тогда
		МассивФИО.Добавить(СокрЛП(Объект.Имя));	
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.Отчество) Тогда
		МассивФИО.Добавить(СокрЛП(Объект.Отчество));	
	КонецЕсли;
	Объект.Наименование = СтрСоединить(МассивФИО, " ");

КонецПроцедуры
